{
  "main": [
    {
      "title": "SWEET-Cat: A catalogue of parameters for Stars With ExoplanETs. I. New atmospheric parameters and masses for 48 stars with planets",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2013A&A...556A.150S/abstract",
      "authors": "N. C. Santos, S. G. Sousa, A. Mortier, V. Neves, V. Adibekyan, M. Tsantaki, E. Delgado Mena, X. Bonfils, G. Israelian, M. Mayor, and S. Udry",
      "abstract": "Context. Thanks to the importance that the star-planet relation has to our understanding of the planet formation process, the precise determination of stellar parameters for the ever increasing number of discovered extra-solar planets is of great relevance. Furthermore, precise stellar parameters are needed to fully characterize the planet properties. It is thus important to continue the efforts to determine, in the most uniform way possible, the parameters for stars with planets as new discoveries are announced. Aims: In this paper we present new precise atmospheric parameters for a sample of 48 stars with planets. We then take the opportunity to present a new catalogue of stellar parameters for FGK and M stars with planets detected by radial velocity, transit, and astrometry programs. Methods: Stellar atmospheric parameters and masses for the 48 stars were derived assuming local thermodynamic equilibrium (LTE) and using high-resolution and high signal-to-noise spectra. The methodology used is based on the measurement of equivalent widths for a list of iron lines and making use of iron ionization and excitation equilibrium principles. For the catalogue, and whenever possible, we used parameters derived in previous works published by our team, using well-defined methodologies for the derivation of stellar atmospheric parameters. This set of parameters amounts to over 65% of all planet host stars known, including more than 90% of all stars with planets discovered through radial velocity surveys. For the remaining targets, stellar parameters were collected from the literature. Results: The stellar parameters for the 48 stars are presented and compared with previously determined literature values. For the catalogue, we compile values for the effective temperature, surface gravity, metallicity, and stellar mass for almost all the planet host stars listed in the Extrasolar Planets Encyclopaedia. This data will be updated on a continuous basis. The compiled catalogue is available online. The data can be used for statistical studies of the star-planet correlation, as well as for the derivation of consistent properties for known planets. Based on observations collected at ESO facilities under programs 088.C-0892(A), 089.C-0444(A), 090.C-0146(A) (FEROS spectrograph, 2.2-m ESO-MPI telescope, La Silla), 380.C-0083(A), and 083.C-0174(A) (UVES spectrograph, ESO VLT Kueyen telescope, Paranal)."
    },
    {
      "title": "SWEET-Cat update and FASMA. A new minimization procedure for stellar parameters using high-quality spectra",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...600A..69A/abstract",
      "authors": "D. T. Andreasen, S. G. Sousa, M. Tsantaki, G. D. C Teixeira, A. Mortier, N. C. Santos, L. Suarez-Andres, E. Delgado Mena, and A. C. S. Ferreira",
      "abstract": "Context. Thanks to the importance that the star-planet relation has to our understanding of the planet formation process, the precise determination of stellar parameters for the ever increasing number of discovered extrasolar planets is of great relevance. Furthermore, precise stellar parameters are needed to fully characterize the planet properties. It is thus important to continue the efforts to determine, in the most uniform way possible, the parameters for stars with planets as new discoveries are announced. Aims. In this paper we present new precise atmospheric parameters for a sample of 50 stars with planets. The results are presented in the catalogue: SWEET-Cat. Methods. Stellar atmospheric parameters and masses for the 50 stars were derived assuming local thermodynamic equilibrium and using high-resolution and high signal-to-noise spectra. The methodology used is based on the measurement of equivalent widths with ARES2 for a list of iron lines. The line abundances were derived using MOOG. We then used the curve of growth analysis to determine the parameters. We implemented a new minimization procedure which significantly improves the computational time. Results. The stellar parameters for the 50 stars are presented and compared with previously determined literature values. For SWEET-Cat, we compile values for the effective temperature, surface gravity, metallicity, and stellar mass for almost all the planet host stars listed in the Extrasolar Planets Encyclopaedia. This data will be updated on a continuous basis. The data can be used for statistical studies of the star-planet correlation, and for the derivation of consistent properties for known planets."
            }
          ],
  "other": [
    {
      "title": "Which Type of Planets do We Expect to Observe in the Habitable Zone?",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016OLEB...46..351A/abstract",
      "authors": "V. Adibekyan, P. Figueira, and N. C. Santos",
      "abstract": "We used a sample of super-Earth-like planets detected by the Doppler spectroscopy and transit techniques to explore the dependence of orbital parameters of the planets on the metallicity of their host stars. We confirm the previous results (although still based on small samples of planets) that super-Earths orbiting around metal-rich stars are not observed to be as distant from their host stars as we observe their metal-poor counterparts to be. The orbits of these super-Earths with metal-rich hosts usually do not reach into the Habitable Zone (HZ), keeping them very hot and inhabitable. We found that most of the known planets in the HZ are orbiting their GK-type hosts which are metal-poor. The metal-poor nature of planets in the HZ suggests a high Mg abundance relative to Si and high Si abundance relative to Fe. These results lead us to speculate that HZ planets might be more frequent in the ancient Galaxy and had compositions different from that of our Earth."},
    {
      "title": "Observational evidence for two distinct giant planet populations",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...603A..30S/abstract",
      "authors": "N. C. Santos, V. Adibekyan, P. Figueira, D. T. Andreasen, S. C. C. Barros, E. Delgado-Mena, O. Demangeon, J. P. Faria, M. Oshagh, S. G. Sousa, P. T. P. Viana, and A. C. S. Ferreira",
      "abstract": "Context. Analysis of the statistical properties of exoplanets, together with those of their host stars, are providing a unique view into the process of planet formation and evolution. Aims: In this paper we explore the properties of the mass distribution of giant planet companions to solar-type stars, in a quest for clues about their formation process. Methods: With this goal in mind we studied, with the help of standard statistical tests, the mass distribution of giant planets using data from the exoplanet.eu catalog and the SWEET-Cat database of stellar parameters for stars with planets. Results: We show that the mass distribution of giant planet companions is likely to present more than one population with a change in regime around 4 MJup. Above this value host stars tend to be more metal poor and more massive and have [Fe/H] distributions that are statistically similar to those observed in field stars of similar mass. On the other hand, stars that host planets below this limit show the well-known metallicity-giant planet frequency correlation. Conclusions: We discuss these results in light of various planet formation models and explore the implications they may have on our understanding of the formation of giant planets. In particular, we discuss the possibility that the existence of two separate populations of giant planets indicates that two different processes of formation are at play."}
]
}
