{
  "main": [{
      "title": "SWEET-Cat: A catalogue of parameters for Stars With ExoplanETs. I. New atmospheric parameters and masses for 48 stars with planets",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2013A&A...556A.150S/abstract",
      "authors": "N. C. Santos, S. G. Sousa, A. Mortier, V. Neves, V. Adibekyan, M. Tsantaki, E. Delgado Mena, X. Bonfils, G. Israelian, M. Mayor, and S. Udry",
      "abstract": "Context. Thanks to the importance that the star-planet relation has to our understanding of the planet formation process, the precise determination of stellar parameters for the ever increasing number of discovered extra-solar planets is of great relevance. Furthermore, precise stellar parameters are needed to fully characterize the planet properties. It is thus important to continue the efforts to determine, in the most uniform way possible, the parameters for stars with planets as new discoveries are announced. Aims: In this paper we present new precise atmospheric parameters for a sample of 48 stars with planets. We then take the opportunity to present a new catalogue of stellar parameters for FGK and M stars with planets detected by radial velocity, transit, and astrometry programs. Methods: Stellar atmospheric parameters and masses for the 48 stars were derived assuming local thermodynamic equilibrium (LTE) and using high-resolution and high signal-to-noise spectra. The methodology used is based on the measurement of equivalent widths for a list of iron lines and making use of iron ionization and excitation equilibrium principles. For the catalogue, and whenever possible, we used parameters derived in previous works published by our team, using well-defined methodologies for the derivation of stellar atmospheric parameters. This set of parameters amounts to over 65% of all planet host stars known, including more than 90% of all stars with planets discovered through radial velocity surveys. For the remaining targets, stellar parameters were collected from the literature. Results: The stellar parameters for the 48 stars are presented and compared with previously determined literature values. For the catalogue, we compile values for the effective temperature, surface gravity, metallicity, and stellar mass for almost all the planet host stars listed in the Extrasolar Planets Encyclopaedia. This data will be updated on a continuous basis. The compiled catalogue is available online. The data can be used for statistical studies of the star-planet correlation, as well as for the derivation of consistent properties for known planets. Based on observations collected at ESO facilities under programs 088.C-0892(A), 089.C-0444(A), 090.C-0146(A) (FEROS spectrograph, 2.2-m ESO-MPI telescope, La Silla), 380.C-0083(A), and 083.C-0174(A) (UVES spectrograph, ESO VLT Kueyen telescope, Paranal)."
    },
    {
      "title": "SWEET-Cat update and FASMA. A new minimization procedure for stellar parameters using high-quality spectra",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...600A..69A/abstract",
      "authors": "D. T. Andreasen, S. G. Sousa, M. Tsantaki, G. D. C Teixeira, A. Mortier, N. C. Santos, L. Suarez-Andres, E. Delgado Mena, and A. C. S. Ferreira",
      "abstract": "Context. Thanks to the importance that the star-planet relation has to our understanding of the planet formation process, the precise determination of stellar parameters for the ever increasing number of discovered extrasolar planets is of great relevance. Furthermore, precise stellar parameters are needed to fully characterize the planet properties. It is thus important to continue the efforts to determine, in the most uniform way possible, the parameters for stars with planets as new discoveries are announced. Aims. In this paper we present new precise atmospheric parameters for a sample of 50 stars with planets. The results are presented in the catalogue: SWEET-Cat. Methods. Stellar atmospheric parameters and masses for the 50 stars were derived assuming local thermodynamic equilibrium and using high-resolution and high signal-to-noise spectra. The methodology used is based on the measurement of equivalent widths with ARES2 for a list of iron lines. The line abundances were derived using MOOG. We then used the curve of growth analysis to determine the parameters. We implemented a new minimization procedure which significantly improves the computational time. Results. The stellar parameters for the 50 stars are presented and compared with previously determined literature values. For SWEET-Cat, we compile values for the effective temperature, surface gravity, metallicity, and stellar mass for almost all the planet host stars listed in the Extrasolar Planets Encyclopaedia. This data will be updated on a continuous basis. The data can be used for statistical studies of the star-planet correlation, and for the derivation of consistent properties for known planets."
    },
    {
     "title": "Homogeneous spectroscopic parameters for bright planet host stars from the northern hemisphere . The impact on stellar and planetary mass",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2015A&A...576A..94S/abstract",
     "authors": "Sousa, S. G.; Santos, N. C.; Mortier, A.; Tsantaki, M.; Adibekyan, V.; Delgado  Mena, E.; Israelian, G.; Rojas-Ayala, B.; Neves, V.",
     "abstract": "Aims: In this work we derive new precise and homogeneous parameters for 37 stars with planets. For this purpose, we analyze high resolution spectra obtained by the NARVAL spectrograph for a sample composed of bright planet host stars in the northern hemisphere. The new parameters are included in the SWEET-Cat online catalogue.
     Methods: To ensure that the catalogue is homogeneous, we use our standard spectroscopic analysis procedure, ARES+MOOG, to derive effective temperatures, surface gravities, and metallicities. These spectroscopic stellar parameters are then used as input to compute the stellar mass and radius, which are fundamental for the derivation of the planetary mass and radius.
     Results: We show that the spectroscopic parameters, masses, and radii are generally in good agreement with the values available in online databases of exoplanets. There are some exceptions, especially for the evolved stars. These are analyzed in detail focusing on the effect of the stellar mass on the derived planetary mass.
     Conclusions: We conclude that the stellar mass estimations for giant stars should be managed with extreme caution when using them to compute the planetary masses. We report examples within this sample where the differences in planetary mass can be as high as 100% in the most extreme cases. Based on observations obtained at the Telescope Bernard Lyot (USR5026) operated by the Observatoire Midi-Pyrénées and the Institut National des Science de l'Univers of the Centre National de la Recherche Scientifique of France (Run ID L131N11 - OPTICON_2013A_027)."
    },
    {
     "title": "New and updated stellar parameters for 90 transit hosts. The effect of the surface gravity",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2013A&A...558A.106M/abstract",
     "authors": "Mortier, A.; Santos, N. C.; Sousa, S. G.; Fernandes, J. M.; Adibekyan, V. Zh.; Delgado Mena, E.; Montalto, M.; Israelian, G.",
     "abstract": "Context. Precise stellar parameters are crucial in exoplanet research for correctly determining the planetary parameters. For stars hosting a transiting planet, determining the planetary mass and radius depends on the stellar mass and radius, which in turn depend on the atmospheric stellar parameters. Different methods can provide different results, which leads to different planet characteristics.
     Aims: In this paper, we use a uniform method to spectroscopically derive stellar atmospheric parameters, chemical abundances, stellar masses, and stellar radii for a sample of 90 transit hosts. Surface gravities are also derived photometrically using the stellar density as derived from the light curve. We study the effect of using these different surface gravities on the determination of the chemical abundances and the stellar mass and radius.
     Methods: A spectroscopic analysis based on Kurucz models in local thermodynamical equilibrium was performed through the MOOG code to derive the atmospheric parameters and the chemical abundances. The photometric surface gravity was determined through isochrone fitting and the use of the stellar density, directly determined from the light curve. Stellar masses and radii are determined through calibration formulae.
     Results: Spectroscopic and photometric surface gravities differ, but this has very little effect on the precise determination of the stellar mass in our spectroscopic analysis. The stellar radius, and hence the planetary radius, is most affected by the surface gravity discrepancies. For the chemical abundances, the difference is, as expected, only noticable for the abundances derived from analyzing lines of ionized species. The data presented herein are based on observations collected at the La Silla Paranal Observatory, ESO (Chile) with the FEROS spectrograph at the 2.2-m telescope (ESO runs ID 088.C-0892, 089.C-0444, 090.C-0146) and the HARPS spectrograph at the 3.6-m telescope (ESO archive), the Paranal Observatory, ESO (Chile) with the UVES spectrograph at the VLT Kueyen telescope (ESO run ID 083.C-0174), at the Spanish Observatorio del Roque de los Muchachos of the Instituto de Astrofísica de Canarias with the FIES spectrograph at the Nordic Optical Telescope, operated on the island of La Palma jointly by Denmark, Finland, Iceland, Norway, and Sweden (program ID 40-203), and at the Observatoire de Haute-Provence (OHP, CNRS/OAMP), France with the SOPHIE spectrographs at the 1.93-m telescope (program ID 11B.DISC.SOUS).Table 4 is available in electronic form at http://www.aanda.orgFull Table 5 is only available at the CDS via anonymous ftp to http://cdsarc.u-strasbg.fr (ftp://130.79.128.5) or via http://cdsarc.u-strasbg.fr/viz-bin/qcat?J/A+A/558/A106
     "
    },
    {
     "title": "Spectroscopic parameters for solar-type stars with moderate-to-high rotation. New parameters for ten planet hosts",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014A&A...570A..80T/abstract",
     "authors": "Tsantaki, M.; Sousa, S. G.; Santos, N. C.; Montalto, M.; Delgado-Mena, E.; Mortier, A.; Adibekyan, V.; Israelian, G.",
     "abstract": "Context. Planetary studies demand precise and accurate stellar parameters as input for inferring the planetary properties. Different methods often provide different results that could lead to biases in the planetary parameters.
     Aims: In this work, we present a refinement of the spectral synthesis technique designed to treat fast rotating stars better. This method is used to derive precise stellar parameters, namely effective temperature, surface gravity, metallicity, and rotational velocity. The procedure is tested for FGK stars with low and moderate-to-high rotation rates.
     Methods: The spectroscopic analysis is based on the spectral synthesis package Spectroscopy Made Easy (SME), which assumes Kurucz model atmospheres in LTE. The line list where the synthesis is conducted is comprised of iron lines, and the atomic data are derived after solar calibration.
     Results: The comparison of our stellar parameters shows good agreement with literature values, both for slowly and for fast rotating stars. In addition, our results are on the same scale as the parameters derived from the iron ionization and excitation method presented in our previous works. We present new atmospheric parameters for 10 transiting planet hosts as an update to the SWEET-Cat catalog. We also re-analyze their transit light curves to derive new updated planetary properties. Based on observations collected at the La Silla Observatory, ESO (Chile) with the FEROS spectrograph at the 2.2 m telescope (ESO runs ID 089.C-0444(A), 088.C-0892(A)) and with the HARPS spectrograph at the 3.6 m telescope (ESO runs ID 072.C-0488(E), 079.C-0127(A)); at the Observatoire de Haute-Provence (OHP, CNRS/OAMP), France, with the SOPHIE spectrograph at the 1.93 m telescope and at the Observatoire Midi-Pyrénées (CNRS), France, with the NARVAL spectrograph at the 2 m Bernard Lyot Telescope (Run ID L131N11).Appendix A is available in electronic form at http://www.aanda.org
     "
  }
  ],
  "other": [{
      "title": "Orbital and physical properties of planets and their hosts: new insights on planet formation and evolution",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2013A&A...560A..51A/abstract",
      "authors": "V. Zh. Adibekyan, P. Figueira, N. C. Santos, A. Mortier, C. Mordasini, E. Delgado Mena, S. G. Sousa, A. C. M. Correia, G. Israelian, and M. Oshagh",
      "abstract": "Aims: We explore the relations between physical and orbital properties of planets and properties of their host stars to identify the main observable signatures of the formation and evolution processes of planetary systems. Methods: We used a large sample of FGK dwarf planet-hosting stars with stellar parameters derived in a homogeneous way from the SWEET-Cat database to study the relation between stellar metallicity and position of planets in the period-mass diagram. We then used all the radial-velocity-detected planets orbiting FGK stars to explore the role of planet-disk and planet-planet interaction on the evolution of orbital properties of planets with masses above 1 MJup. Results: Using a large sample of FGK dwarf hosts we show that planets orbiting metal-poor stars have longer periods than those in metal-rich systems. This trend is valid for masses at least from 10 M to 4 MJup. Earth-like planets orbiting metal-rich stars always show shorter periods (fewer than 20 days) than those orbiting metal-poor stars. However, in the short-period regime there are a similar number of planets orbiting metal-poor stars. We also found statistically significant evidence that very high mass giants (with a mass higher than 4 MJup) have on average more eccentric orbits than giant planets with lower mass. Finally, we show that the eccentricity of planets with masses higher than 4 MJup tends to be lower for planets with shorter periods. Conclusions: Our results suggest that the planets in the P - MP diagram are evolving differently because of a mechanism that operates over a wide range of planetary masses. This mechanism is stronger or weaker, depending on the metallicity of the respective system. One possibility is that planets in metal-poor disks form farther out from their central star and/or they form later and do not have time to migrate as far as the planets in metal-rich systems. The trends and dependencies obtained for very high mass planetary systems suggest that planet-disk interaction is a very important and orbit-shaping mechanism for planets in the high-mass domain."
    },
    {
      "title": "Which Type of Planets do We Expect to Observe in the Habitable Zone?",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016OLEB...46..351A/abstract",
      "authors": "V. Adibekyan, P. Figueira, and N. C. Santos",
      "abstract": "We used a sample of super-Earth-like planets detected by the Doppler spectroscopy and transit techniques to explore the dependence of orbital parameters of the planets on the metallicity of their host stars. We confirm the previous results (although still based on small samples of planets) that super-Earths orbiting around metal-rich stars are not observed to be as distant from their host stars as we observe their metal-poor counterparts to be. The orbits of these super-Earths with metal-rich hosts usually do not reach into the Habitable Zone (HZ), keeping them very hot and inhabitable. We found that most of the known planets in the HZ are orbiting their GK-type hosts which are metal-poor. The metal-poor nature of planets in the HZ suggests a high Mg abundance relative to Si and high Si abundance relative to Fe. These results lead us to speculate that HZ planets might be more frequent in the ancient Galaxy and had compositions different from that of our Earth."
    },
    {
      "title": "Observational evidence for two distinct giant planet populations",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...603A..30S/abstract",
      "authors": "N. C. Santos, V. Adibekyan, P. Figueira, D. T. Andreasen, S. C. C. Barros, E. Delgado-Mena, O. Demangeon, J. P. Faria, M. Oshagh, S. G. Sousa, P. T. P. Viana, and A. C. S. Ferreira",
      "abstract": "Context. Analysis of the statistical properties of exoplanets, together with those of their host stars, are providing a unique view into the process of planet formation and evolution. Aims: In this paper we explore the properties of the mass distribution of giant planet companions to solar-type stars, in a quest for clues about their formation process. Methods: With this goal in mind we studied, with the help of standard statistical tests, the mass distribution of giant planets using data from the exoplanet.eu catalog and the SWEET-Cat database of stellar parameters for stars with planets. Results: We show that the mass distribution of giant planet companions is likely to present more than one population with a change in regime around 4 MJup. Above this value host stars tend to be more metal poor and more massive and have [Fe/H] distributions that are statistically similar to those observed in field stars of similar mass. On the other hand, stars that host planets below this limit show the well-known metallicity-giant planet frequency correlation. Conclusions: We discuss these results in light of various planet formation models and explore the implications they may have on our understanding of the formation of giant planets. In particular, we discuss the possibility that the existence of two separate populations of giant planets indicates that two different processes of formation are at play."
    },
    {
      "title": "ZASPE: A Code to Measure Stellar Atmospheric Parameters and their Covariance from Spectra",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017MNRAS.467..971B/abstract",
      "authors": "Brahm, Rafael; Jordán, Andrés; Hartman, Joel; Bakos, Gáspár",
      "abstract": "We describe the Zonal Atmospheric Stellar Parameters Estimator (zaspe), a new algorithm, and its associated code, for determining precise stellar atmospheric parameters and their uncertainties from high-resolution echelle spectra of FGK-type stars. zaspe estimates stellar atmospheric parameters by comparing the observed spectrum against a grid of synthetic spectra only in the most sensitive spectral zones to changes in the atmospheric parameters. Realistic uncertainties in the parameters are computed from the data itself, by taking into account the systematic mismatches between the observed spectrum and the best-fitting synthetic one. The covariances between the parameters are also estimated in the process. zaspe can in principle use any pre-calculated grid of synthetic spectra, but unbiased grids are required to obtain accurate parameters. We tested the performance of two existing libraries, and we concluded that neither is suitable for computing precise atmospheric parameters. We describe  a process to synthesize a new library of synthetic spectra that was found to generate consistent results when compared with parameters obtained with different methods (interferometry, asteroseismology, equivalent widths)."
    },
    {
      "title": "Age consistency between exoplanet hosts and field stars",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016A&A...585A...5B/abstract",
      "authors": "Bonfanti, A.; Ortolani, S.; Nascimbeni, V.",
      "abstract": "Context. Transiting planets around stars are discovered mostly through photometric surveys. Unlike radial velocity surveys, photometric surveys do not tend to target slow rotators, inactive or metal-rich stars. Nevertheless, we suspect that observational biases could also impact transiting-planet hosts.
      Aims: This paper aims to evaluate how selection effects reflect on the evolutionary stage of both a limited sample of transiting-planet host stars (TPH) and a wider sample of planet-hosting stars detected through radial velocity analysis. Then, thanks to uniform derivation of stellar ages, a homogeneous comparison between exoplanet hosts and field star age distributions is developed.
      Methods: Stellar parameters have been computed through our custom-developed isochrone placement algorithm, according to Padova evolutionary models. The notable aspects of our algorithm include the treatment of element diffusion, activity checks in terms of log{R'HK} and vsini, and the evaluation of the stellar evolutionary speed in the Hertzsprung-Russel diagram in order to better constrain age. Working with TPH, the observational stellar mean density ρ⋆ allows us to compute stellar luminosity even if the distance is not available, by combining ρ⋆ with the spectroscopic log g.
      Results: The median value of the TPH ages is 5 Gyr. Even if this sample is not very large, however the result is very similar to what we found for the sample of spectroscopic hosts, whose modal and median values are [3, 3.5) Gyr and 4.8 Gyr, respectively. Thus, these stellar samples suffer almost the same selection effects. An analysis of MS stars of the solar neighbourhood belonging to the same spectral types bring to an age distribution similar to the previous ones and centered around solar age value. Therefore, the age of our Sun is consistent with the age distribution of solar neighbourhood stars with spectral types from late F to early K, regardless of whether they harbour planets or not. We considered the possibility that our selected samples are older than the average disc population."
    },
    {
      "title": "New planetary systems from the Calan-Hertfordshire Extrasolar Planet Search",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017MNRAS.466..443J/abstract",
      "authors": "Jenkins, J. S.; Jones, H. R. A.; Tuomi, M.; Díaz, M.; Cordero, J. P.; Aguayo, A.; Pantoja, B.; Arriagada, P.; Mahu, R.; Brahm, R.; Rojo, P.; Soto, M. G.; Ivanyuk, O.; Becerra Yoma, N.; Day-Jones, A. C.; Ruiz, M. T.; Pavlenko, Y. V.; Barnes, J. R.; Murgas, F.; Pinfield, D. J. ; Jones, M. I.; López-Morales, M.; Shectman, S.; Butler, R. P.; Minniti, D.",
      "abstract": "We report the discovery of eight new giant planets, and updated orbits for four known planets, orbiting dwarf and subgiant stars using the CORALIE, HARPS, and MIKE instruments as part of the Calan-Hertfordshire Extrasolar Planet Search. The planets have masses in the range 1.1-5.4 MJ's, orbital periods from 40 to 2900 d, and eccentricities from 0.0 to 0.6. They include a double-planet system orbiting the most massive star in our sample (HD147873), two eccentric giant planets (HD128356b and HD154672b), and a rare 14 Herculis analogue (HD224538b). We highlight some population correlations from the sample of radial velocity detected planets orbiting nearby stars, including the mass function exponential distribution, confirmation of the growing body of evidence that low-mass planets tend to be found orbiting more metal-poor stars than giant planets, and a possible period-metallicity correlation for planets with masses 〉0.1 MJ, based on a metallicity difference of 0.16 dex between the population of planets with orbital periods less than 100 d and those with orbital periods greater than 100 d."
    },
    {
     "title": "Revisiting the correlation between stellar activity and planetary surface gravity",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014A&A...572A..51F/abstract",
     "authors": "Figueira, P.; Oshagh, M.; Adibekyan, V. Zh.; Santos, N. C.",
     "abstract": "Aims: We re-evaluate the correlation between planetary surface gravity and stellar host activity as measured by the index log (R'HK). This correlation, previously identified by Hartman (2010, ApJ, 717, L138), is now analyzed in light of an extended measurement dataset, roughly three times larger than the original one.
     Methods: We calculated the Spearman rank correlation coefficient between the two quantities and its associated p-value. The correlation coefficient was calculated for both the full dataset and the star-planet pairs that follow the conditions proposed by Hartman (2010). To do so, we considered effective temperatures both as collected from the literature and from the SWEET-Cat catalog, which provides a more homogeneous and accurate effective temperature determination.
     Results: The analysis delivers significant correlation coefficients, but with a lower value than those obtained by Hartman (2010). The two datasets are compatible, and we show that a correlation coefficient as high as previously published can arise naturally from a small-number statistics analysis of the current dataset. The correlation is recovered for star-planet pairs selected using the different conditions proposed by Hartman (2010). Remarkably, the usage of SWEET-Cat temperatures led to higher correlation coefficient values. We highlight and discuss the role of the correlation betwen different parameters such as effective temperature and activity index. Several additional effects on top of those discussed previously were considered, but none fully explains the detected correlation. In light of the complex issue discussed here, we encourage the different follow-up teams to publish their activity index values in the form of a log (R'HK) index so that a comparison across stars and instruments can be pursued. Appendix A is available in electronic form at http://www.aanda.org.
     "
    },
    {
     "title": "C/O Ratios of Stars with Transiting Hot Jupiter Exoplanets",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014ApJ...788...39T/abstract",
     "authors": "Teske, Johanna K.; Cunha, Katia; Smith, Verne V.; Schuler, Simon C.; Griffith, Caitlin A.",
     "abstract": "The relative abundances of carbon and oxygen have long been recognized as fundamental diagnostics of stellar chemical evolution. Now, the growing number of exoplanet observations enable estimation of these elements in exoplanetary atmospheres. In hot Jupiters, the C/O ratio affects the partitioning of carbon in the major observable molecules, making these elements diagnostic of temperature structure and composition. Here we present measurements of carbon and oxygen abundances in 16 stars that host transiting hot Jupiter exoplanets, and we compare our C/O ratios to those measured in larger samples of host stars, as well as those estimated for the corresponding exoplanet atmospheres. With standard stellar abundance analysis we derive stellar parameters as well as [C/H] and [O/H] from multiple abundance indicators, including synthesis fitting of the [O I] λ6300 line and non-LTE corrections for the O I triplet. Our results, in agreement with recent suggestions, indicate that previously measured exoplanet host star C/O ratios may have been overestimated. The mean transiting exoplanet host star C/O ratio from this sample is 0.54 (C/O☉ = 0.54), versus previously measured C/Ohost star means of ~0.65-0.75. We also observe the increase in C/O with [Fe/H] expected for all stars based on Galactic chemical evolution; a linear fit to our results falls slightly below that of other exoplanet host star studies but has a similar slope. Though the C/O ratios of even the most-observed exoplanets are still uncertain, the more precise abundance analysis possible right now for their host stars can help constrain these planets' formation environments and current compositions. Based on data collected at Subaru Telescope, which is operated by the National Astronomical Observatory of Japan. Some of the data presented herein were obtained at the W. M. Keck Observatory, which is operated as a scientific partnership among the California Institute of Technology, the University of California, and the National Aeronautics and Space Administration. The Observatory was made possible by the generous financial support of the W. M. Keck Foundation."
    },
    {
     "title": "Star-planet connection through metallicity",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014EAS....67..351A/abstract",
     "authors": "Adibekyan, V. Zh.; Figueira, P.; Santos, N. C.; Israelian, G.; Mortier, A.; Mordasini, C.; Delgado Mena, E.; Sousa, S. G.; Correi, A. C. M.; Oshagh, M.",
     "abstract": "We used a large sample of FGK dwarf planet-hosting stars with stellar parameters derived in a homogeneous way from the SWEET-Cat database (Santos et al. 2013) to study the relation between stellar metallicity and position of planets in the period-mass diagram. Using this large sample we show that planets orbiting metal-poor stars have longer periods than those in metal-rich systems. This trend is valid for masses at least from ≈ 10 M⊕ to ≈ 4 MJup. Moreover, Earth-like planets orbiting metal-rich stars always show shorter periods (≤20 days) than those orbiting metal-poor stars. However, in the short-period regime there are a similar number of planets orbiting metal-poor stars. Our results suggest that the planets in the P-MP diagram are evolving differently because of a mechanism that operates over a wide range of planetary masses. This mechanism is stronger or weaker depending on the metallicity of the respective system. Most probably planets in metal-poor disks form farther out from their central star and/or they form later and do not have time to migrate as far as the planets in metal-rich systems."
    },
    {
     "title": "Searching for chemical signatures of brown dwarf formation",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...602A..38M/abstract",
     "authors": "Maldonado, J.; Villaver, E.",
     "abstract": "Context. Recent studies have shown that close-in brown dwarfs in the mass range 35-55 MJup are almost depleted as companions to stars, suggesting that objects with masses above and below this gap might have different formation mechanisms.
     Aims: We aim to test whether stars harbouring massive brown dwarfs and stars with low-mass brown dwarfs show any chemical peculiarity that could be related to different formation processes.
     Methods: Our methodology is based on the analysis of high-resolution échelle spectra (R 57 000) from 2-3 m class telescopes. We determine the fundamental stellar parameters, as well as individual abundances of C, O, Na, Mg, Al, Si, S, Ca, Sc, Ti, V, Cr, Mn, Co, Ni, and Zn for a large sample of stars known to have a substellar companion in the brown dwarf regime. The sample is divided into stars hosting massive and low-mass brown dwarfs. Following previous works, a threshold of 42.5 MJup was considered. The metallicity and abundance trends of the two subsamples are compared and set in the context of current models of planetary and brown dwarf formation.
     Results: Our results confirm that stars with brown dwarf companions do not follow the well-established gas-giant planet metallicity correlation seen in main-sequence planet hosts. Stars harbouring massive brown dwarfs show similar metallicity and abundance distribution as stars without known planets or with low-mass planets. We find a tendency of stars harbouring less-massive brown dwarfs of having slightly higher metallicity, [XFe/Fe] values, and abundances of Sc ii, Mn i, and Ni i than the stars having the massive brown dwarfs. The data suggest, as previously reported, that massive and low-mass brown dwarfs might present differences in period and eccentricity.
     Conclusions: We find evidence of a non-metallicity dependent mechanism for the formation of massive brown dwarfs. Our results agree with a scenario in which massive brown dwarfs are formed as stars. At high metallicities, the core-accretion mechanism might become efficient in the formation of low-mass brown dwarfs, while at lower metallicities low-mass brown dwarfs could form by gravitational instability in turbulent protostellar discs. Based on observations made with the Mercator Telescope; on observations made with the Nordic Optical Telescope; on data products from the SOPHIE archive; on data products from the ELODIE archive; and on data products from observations made with ESO Telescopes at the La Silla Paranal Observatory under programmes ID 072. C-0488(E), 076.C-0155(A), 076.C-0429(A), 078.C-0133(A), 079.C-0329(A), 082.C-0333(A), 083.C-0174(A), 083.C-0413(A), 085. C-0019(A), 085.C-0393(A), 087.A-9029(A), 087.C-0831(A), 090.C-0421(A), 093.C-0409(A), 094.D-0596(A), 095.A-9029(C), 178.D-0361(B), 183.C-0972(A), 184.C-0639(A), and 188.C-0779(A).
     "
    },
    {
    "title": "Further Constraints on the Optical Transmission Spectrum of HAT-P-1b",
    "adsabs": " https://ui.adsabs.harvard.edu/#abs/2015ApJ...811...55M/abstract",
    "authors": "Montalto, M.; Iro, N.; Santos, N. C.; Desidera, S.; Martins, J. H. C.; Figueira, P.; Alonso, R.",
    "abstract": "We report on novel observations of HAT-P-1 aimed at constraining the optical transmission spectrum of the atmosphere of its transiting hot-Jupiter exoplanet. Ground-based differential spectrophotometry was performed over two transit windows using the DOLORES spectrograph at the Telescopio Nazionale Galileo. Our measurements imply an average planet to star radius ratio equal to Rp/R* = (0.1159 ± 0.0005). This result is consistent with the value obtained from recent near-infrared measurements of this object, but differs from previously reported optical measurements, being lower by around 4.4 exoplanet scale heights. Analyzing the data over five different spectral bins of ∼600 Å wide, we observed a single peaked spectrum (3.7 σ level) with a blue cutoff corresponding to the blue edge of the broad absorption wing of sodium and an increased absorption in the region in-between 6180 and 7400 Å. We also infer that the width of the broad absorption wings due to alkali metals is likely narrower than the one implied by solar abundance clear atmospheric models. We interpret the result as evidence that HAT-P-1b has a partially clear atmosphere at optical wavelengths with a more modest contribution from an optical absorber than previously reported."
   },
   {
     "title": "An upper boundary in the mass-metallicity plane of exo-Neptunes",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016MNRAS.461.1841C/abstract",
     "authors": "Courcol, Bastien; Bouchy, François; Deleuil, Magali",
     "abstract": "With the progress of detection techniques, the number of low-mass and small-size exoplanets is increasing rapidly. However their characteristics and formation mechanisms are not yet fully understood. The metallicity of the host star is a critical parameter in such processes and can impact the occurrence rate or physical properties of these planets. While a frequency-metallicity correlation has been found for giant planets, this is still an ongoing debate for their smaller counterparts. Using the published parameters of a sample of 157 exoplanets lighter than 40 M⊕, we explore the mass-metallicity space of Neptunes and super-Earths. We show the existence of a maximal mass that increases with metallicity, that also depends on the period of these planets. This seems to favour in situ formation or alternatively a metallicity-driven migration mechanism. It also suggests that the frequency of Neptunes (between 10 and 40 M⊕) is, like giant planets, correlated with the host star metallicity, whereas no correlation is found for super-Earths (〈10 M⊕)"
    },
    {
     "title": "HATS-15b and HATS-16b: Two Massive Planets Transiting Old G Dwarf Stars",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016PASP..128g4401C/abstract",
     "authors": "Ciceri, S.; Mancini, L.; Henning, T.; Bakos, G.; Penev, K.; Brahm, R.; Zhou, G.; Hartman, J. D.; Bayliss, D.; Jordán, A.; Csubry, Z.; de Val-Borro, M.; Bhatti, W.; Rabus, M.; Espinoza, N.; Suc, V.; Schmidt, B.; Noyes, R.; Howard, A. W.; Fulton, B. J. Isaacson, H.; Marcy, G. W.; Butler, R. P.; Arriagada, P.; Crane, J. D.; Shectman, S.; Thompson, I.; Tan, T. G.; Lázár, J.; Papp, I.; Sari, P.",
     "abstract": "We report the discovery of HATS-15 b and HATS-16 b, two massive transiting extrasolar planets orbiting evolved (̃10 Gyr) main-sequence stars. The planet HATS-15 b, which is hosted by a G9 V star (V=14.8 mag), is a hot Jupiter with mass of 2.17\quad +/- \quad 0.15 {M}{{J}} and radius of 1.105\quad +/- \quad 0.040 {R}{{J}}, and it completes its orbit in about 1.7 days. HATS-16 b is a very massive hot Jupiter with mass of 3.27\quad +/- \quad 0.19 {M}{{J}} and radius of 1.30\quad +/- \quad 0.15 {R}{{J}}; it orbits around its G3 V parent star (V=13.8 mag) in ̃2.7 days. HATS-16 is slightly active and shows a periodic photometric modulation, implying a rotational period of 12 days, which is unexpectedly short given its isochronal age. This fast rotation might be the result of the tidal interaction between the star and its planet. The HATSouth network is operated by a collaboration consisting of Princeton University (PU), the Max Planck Institute für Astronomie (MPIA), the Australian National University (ANU), and the Pontificia Universidad Católica de Chile (PUC). The station at Las Campanas Observatory (LCO) of the Carnegie Institute is operated by PU in conjunction with PUC, the station at the High Energy Spectroscopic Survey (H.E.S.S.) site is operated in conjunction with MPIA, and the station at Siding Spring Observatory (SSO) is operated jointly with ANU. Based in part on observations performed at the ESO La Silla Observatory in Chile, with the Coralie and FEROS spectrographs mounted on the Euler-Swiss and MPG 2.2 m telescopes, respectively. This paper includes data gathered with the 6.5 m Magellan Telescopes located at Las Campanas Observatory, Chile. Based in part on data collected at Keck Telescope. Observations obtained with facilities of the Las Cumbres Observatory Global Telescope are used in this paper."
     }
  ]
}
