{
  "main": [{
      "title": "SWEET-Cat: A catalogue of parameters for Stars With ExoplanETs. I. New atmospheric parameters and masses for 48 stars with planets",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2013A&A...556A.150S/abstract",
      "authors": "N. C. Santos, S. G. Sousa, A. Mortier, V. Neves, V. Adibekyan, M. Tsantaki, E. Delgado Mena, X. Bonfils, G. Israelian, M. Mayor, and S. Udry",
      "abstract": "Context. Thanks to the importance that the star-planet relation has to our understanding of the planet formation process, the precise determination of stellar parameters for the ever increasing number of discovered extra-solar planets is of great relevance. Furthermore, precise stellar parameters are needed to fully characterize the planet properties. It is thus important to continue the efforts to determine, in the most uniform way possible, the parameters for stars with planets as new discoveries are announced. Aims: In this paper we present new precise atmospheric parameters for a sample of 48 stars with planets. We then take the opportunity to present a new catalogue of stellar parameters for FGK and M stars with planets detected by radial velocity, transit, and astrometry programs. Methods: Stellar atmospheric parameters and masses for the 48 stars were derived assuming local thermodynamic equilibrium (LTE) and using high-resolution and high signal-to-noise spectra. The methodology used is based on the measurement of equivalent widths for a list of iron lines and making use of iron ionization and excitation equilibrium principles. For the catalogue, and whenever possible, we used parameters derived in previous works published by our team, using well-defined methodologies for the derivation of stellar atmospheric parameters. This set of parameters amounts to over 65% of all planet host stars known, including more than 90% of all stars with planets discovered through radial velocity surveys. For the remaining targets, stellar parameters were collected from the literature. Results: The stellar parameters for the 48 stars are presented and compared with previously determined literature values. For the catalogue, we compile values for the effective temperature, surface gravity, metallicity, and stellar mass for almost all the planet host stars listed in the Extrasolar Planets Encyclopaedia. This data will be updated on a continuous basis. The compiled catalogue is available online. The data can be used for statistical studies of the star-planet correlation, as well as for the derivation of consistent properties for known planets. Based on observations collected at ESO facilities under programs 088.C-0892(A), 089.C-0444(A), 090.C-0146(A) (FEROS spectrograph, 2.2-m ESO-MPI telescope, La Silla), 380.C-0083(A), and 083.C-0174(A) (UVES spectrograph, ESO VLT Kueyen telescope, Paranal)."
    },
    {
      "title": "SWEET-Cat update and FASMA. A new minimization procedure for stellar parameters using high-quality spectra",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...600A..69A/abstract",
      "authors": "D. T. Andreasen, S. G. Sousa, M. Tsantaki, G. D. C Teixeira, A. Mortier, N. C. Santos, L. Suarez-Andres, E. Delgado Mena, and A. C. S. Ferreira",
      "abstract": "Context. Thanks to the importance that the star-planet relation has to our understanding of the planet formation process, the precise determination of stellar parameters for the ever increasing number of discovered extrasolar planets is of great relevance. Furthermore, precise stellar parameters are needed to fully characterize the planet properties. It is thus important to continue the efforts to determine, in the most uniform way possible, the parameters for stars with planets as new discoveries are announced. Aims. In this paper we present new precise atmospheric parameters for a sample of 50 stars with planets. The results are presented in the catalogue: SWEET-Cat. Methods. Stellar atmospheric parameters and masses for the 50 stars were derived assuming local thermodynamic equilibrium and using high-resolution and high signal-to-noise spectra. The methodology used is based on the measurement of equivalent widths with ARES2 for a list of iron lines. The line abundances were derived using MOOG. We then used the curve of growth analysis to determine the parameters. We implemented a new minimization procedure which significantly improves the computational time. Results. The stellar parameters for the 50 stars are presented and compared with previously determined literature values. For SWEET-Cat, we compile values for the effective temperature, surface gravity, metallicity, and stellar mass for almost all the planet host stars listed in the Extrasolar Planets Encyclopaedia. This data will be updated on a continuous basis. The data can be used for statistical studies of the star-planet correlation, and for the derivation of consistent properties for known planets."
    }
  ],
  "other": [{
      "title": "Orbital and physical properties of planets and their hosts: new insights on planet formation and evolution",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2013A&A...560A..51A/abstract",
      "authors": "V. Zh. Adibekyan, P. Figueira, N. C. Santos, A. Mortier, C. Mordasini, E. Delgado Mena, S. G. Sousa, A. C. M. Correia, G. Israelian, and M. Oshagh",
      "abstract": "Aims: We explore the relations between physical and orbital properties of planets and properties of their host stars to identify the main observable signatures of the formation and evolution processes of planetary systems. Methods: We used a large sample of FGK dwarf planet-hosting stars with stellar parameters derived in a homogeneous way from the SWEET-Cat database to study the relation between stellar metallicity and position of planets in the period-mass diagram. We then used all the radial-velocity-detected planets orbiting FGK stars to explore the role of planet-disk and planet-planet interaction on the evolution of orbital properties of planets with masses above 1 MJup. Results: Using a large sample of FGK dwarf hosts we show that planets orbiting metal-poor stars have longer periods than those in metal-rich systems. This trend is valid for masses at least from 10 M to 4 MJup. Earth-like planets orbiting metal-rich stars always show shorter periods (fewer than 20 days) than those orbiting metal-poor stars. However, in the short-period regime there are a similar number of planets orbiting metal-poor stars. We also found statistically significant evidence that very high mass giants (with a mass higher than 4 MJup) have on average more eccentric orbits than giant planets with lower mass. Finally, we show that the eccentricity of planets with masses higher than 4 MJup tends to be lower for planets with shorter periods. Conclusions: Our results suggest that the planets in the P - MP diagram are evolving differently because of a mechanism that operates over a wide range of planetary masses. This mechanism is stronger or weaker, depending on the metallicity of the respective system. One possibility is that planets in metal-poor disks form farther out from their central star and/or they form later and do not have time to migrate as far as the planets in metal-rich systems. The trends and dependencies obtained for very high mass planetary systems suggest that planet-disk interaction is a very important and orbit-shaping mechanism for planets in the high-mass domain."
    },
    {
      "title": "Which Type of Planets do We Expect to Observe in the Habitable Zone?",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016OLEB...46..351A/abstract",
      "authors": "V. Adibekyan, P. Figueira, and N. C. Santos",
      "abstract": "We used a sample of super-Earth-like planets detected by the Doppler spectroscopy and transit techniques to explore the dependence of orbital parameters of the planets on the metallicity of their host stars. We confirm the previous results (although still based on small samples of planets) that super-Earths orbiting around metal-rich stars are not observed to be as distant from their host stars as we observe their metal-poor counterparts to be. The orbits of these super-Earths with metal-rich hosts usually do not reach into the Habitable Zone (HZ), keeping them very hot and inhabitable. We found that most of the known planets in the HZ are orbiting their GK-type hosts which are metal-poor. The metal-poor nature of planets in the HZ suggests a high Mg abundance relative to Si and high Si abundance relative to Fe. These results lead us to speculate that HZ planets might be more frequent in the ancient Galaxy and had compositions different from that of our Earth."
    },
    {
      "title": "Observational evidence for two distinct giant planet populations",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017A&A...603A..30S/abstract",
      "authors": "N. C. Santos, V. Adibekyan, P. Figueira, D. T. Andreasen, S. C. C. Barros, E. Delgado-Mena, O. Demangeon, J. P. Faria, M. Oshagh, S. G. Sousa, P. T. P. Viana, and A. C. S. Ferreira",
      "abstract": "Context. Analysis of the statistical properties of exoplanets, together with those of their host stars, are providing a unique view into the process of planet formation and evolution. Aims: In this paper we explore the properties of the mass distribution of giant planet companions to solar-type stars, in a quest for clues about their formation process. Methods: With this goal in mind we studied, with the help of standard statistical tests, the mass distribution of giant planets using data from the exoplanet.eu catalog and the SWEET-Cat database of stellar parameters for stars with planets. Results: We show that the mass distribution of giant planet companions is likely to present more than one population with a change in regime around 4 MJup. Above this value host stars tend to be more metal poor and more massive and have [Fe/H] distributions that are statistically similar to those observed in field stars of similar mass. On the other hand, stars that host planets below this limit show the well-known metallicity-giant planet frequency correlation. Conclusions: We discuss these results in light of various planet formation models and explore the implications they may have on our understanding of the formation of giant planets. In particular, we discuss the possibility that the existence of two separate populations of giant planets indicates that two different processes of formation are at play."
    },
    {
      "title": "ZASPE: A Code to Measure Stellar Atmospheric Parameters and their Covariance from Spectra",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017MNRAS.467..971B/abstract",
      "authors": "Brahm, Rafael; Jordán, Andrés; Hartman, Joel; Bakos, Gáspár",
      "abstract": "We describe the Zonal Atmospheric Stellar Parameters Estimator (zaspe), a new algorithm, and its associated code, for determining precise stellar atmospheric parameters and their uncertainties from high-resolution echelle spectra of FGK-type stars. zaspe estimates stellar atmospheric parameters by comparing the observed spectrum against a grid of synthetic spectra only in the most sensitive spectral zones to changes in the atmospheric parameters. Realistic uncertainties in the parameters are computed from the data itself, by taking into account the systematic mismatches between the observed spectrum and the best-fitting synthetic one. The covariances between the parameters are also estimated in the process. zaspe can in principle use any pre-calculated grid of synthetic spectra, but unbiased grids are required to obtain accurate parameters. We tested the performance of two existing libraries, and we concluded that neither is suitable for computing precise atmospheric parameters. We describe  a process to synthesize a new library of synthetic spectra that was found to generate consistent results when compared with parameters obtained with different methods (interferometry, asteroseismology, equivalent widths)."
    },
    {
      "title": "Age consistency between exoplanet hosts and field stars",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2016A&A...585A...5B/abstract",
      "authors": "Bonfanti, A.; Ortolani, S.; Nascimbeni, V.",
      "abstract": "Context. Transiting planets around stars are discovered mostly through photometric surveys. Unlike radial velocity surveys, photometric surveys do not tend to target slow rotators, inactive or metal-rich stars. Nevertheless, we suspect that observational biases could also impact transiting-planet hosts.
      Aims: This paper aims to evaluate how selection effects reflect on the evolutionary stage of both a limited sample of transiting-planet host stars (TPH) and a wider sample of planet-hosting stars detected through radial velocity analysis. Then, thanks to uniform derivation of stellar ages, a homogeneous comparison between exoplanet hosts and field star age distributions is developed.
      Methods: Stellar parameters have been computed through our custom-developed isochrone placement algorithm, according to Padova evolutionary models. The notable aspects of our algorithm include the treatment of element diffusion, activity checks in terms of log{R'HK} and vsini, and the evaluation of the stellar evolutionary speed in the Hertzsprung-Russel diagram in order to better constrain age. Working with TPH, the observational stellar mean density ρ⋆ allows us to compute stellar luminosity even if the distance is not available, by combining ρ⋆ with the spectroscopic log g.
      Results: The median value of the TPH ages is 5 Gyr. Even if this sample is not very large, however the result is very similar to what we found for the sample of spectroscopic hosts, whose modal and median values are [3, 3.5) Gyr and 4.8 Gyr, respectively. Thus, these stellar samples suffer almost the same selection effects. An analysis of MS stars of the solar neighbourhood belonging to the same spectral types bring to an age distribution similar to the previous ones and centered around solar age value. Therefore, the age of our Sun is consistent with the age distribution of solar neighbourhood stars with spectral types from late F to early K, regardless of whether they harbour planets or not. We considered the possibility that our selected samples are older than the average disc population."
    },
    {
      "title": "New planetary systems from the Calan-Hertfordshire Extrasolar Planet Search",
      "adsabs": "https://ui.adsabs.harvard.edu/#abs/2017MNRAS.466..443J/abstract",
      "authors": "Jenkins, J. S.; Jones, H. R. A.; Tuomi, M.; Díaz, M.; Cordero, J. P.; Aguayo, A.; Pantoja, B.; Arriagada, P.; Mahu, R.; Brahm, R.; Rojo, P.; Soto, M. G.; Ivanyuk, O.; Becerra Yoma, N.; Day-Jones, A. C.; Ruiz, M. T.; Pavlenko, Y. V.; Barnes, J. R.; Murgas, F.; Pinfield, D. J. ; Jones, M. I.; López-Morales, M.; Shectman, S.; Butler, R. P.; Minniti, D.
",
      "abstract": "We report the discovery of eight new giant planets, and updated orbits for four known planets, orbiting dwarf and subgiant stars using the CORALIE, HARPS, and MIKE instruments as part of the Calan-Hertfordshire Extrasolar Planet Search. The planets have masses in the range 1.1-5.4 MJ's, orbital periods from 40 to 2900 d, and eccentricities from 0.0 to 0.6. They include a double-planet system orbiting the most massive star in our sample (HD147873), two eccentric giant planets (HD128356b and HD154672b), and a rare 14 Herculis analogue (HD224538b). We highlight some population correlations from the sample of radial velocity detected planets orbiting nearby stars, including the mass function exponential distribution, confirmation of the growing body of evidence that low-mass planets tend to be found orbiting more metal-poor stars than giant planets, and a possible period-metallicity correlation for planets with masses 〉0.1 MJ, based on a metallicity difference of 0.16 dex between the population of planets with orbital periods less than 100 d and those with orbital periods greater than 100 d."
    },
    {
     "title": "Revisiting the correlation between stellar activity and planetary surface gravity",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014A&A...572A..51F/abstract",
     "authors": "Figueira, P.; Oshagh, M.; Adibekyan, V. Zh.; Santos, N. C.",
     "abstract": "Aims: We re-evaluate the correlation between planetary surface gravity and stellar host activity as measured by the index log (R'HK). This correlation, previously identified by Hartman (2010, ApJ, 717, L138), is now analyzed in light of an extended measurement dataset, roughly three times larger than the original one.
     Methods: We calculated the Spearman rank correlation coefficient between the two quantities and its associated p-value. The correlation coefficient was calculated for both the full dataset and the star-planet pairs that follow the conditions proposed by Hartman (2010). To do so, we considered effective temperatures both as collected from the literature and from the SWEET-Cat catalog, which provides a more homogeneous and accurate effective temperature determination.
     Results: The analysis delivers significant correlation coefficients, but with a lower value than those obtained by Hartman (2010). The two datasets are compatible, and we show that a correlation coefficient as high as previously published can arise naturally from a small-number statistics analysis of the current dataset. The correlation is recovered for star-planet pairs selected using the different conditions proposed by Hartman (2010). Remarkably, the usage of SWEET-Cat temperatures led to higher correlation coefficient values. We highlight and discuss the role of the correlation betwen different parameters such as effective temperature and activity index. Several additional effects on top of those discussed previously were considered, but none fully explains the detected correlation. In light of the complex issue discussed here, we encourage the different follow-up teams to publish their activity index values in the form of a log (R'HK) index so that a comparison across stars and instruments can be pursued. Appendix A is available in electronic form at http://www.aanda.org.
     "
    },
    {
     "title": "C/O Ratios of Stars with Transiting Hot Jupiter Exoplanets",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014ApJ...788...39T/abstract",
     "authors": "Teske, Johanna K.; Cunha, Katia; Smith, Verne V.; Schuler, Simon C.; Griffith, Caitlin A.",
     "abstract": "The relative abundances of carbon and oxygen have long been recognized as fundamental diagnostics of stellar chemical evolution. Now, the growing number of exoplanet observations enable estimation of these elements in exoplanetary atmospheres. In hot Jupiters, the C/O ratio affects the partitioning of carbon in the major observable molecules, making these elements diagnostic of temperature structure and composition. Here we present measurements of carbon and oxygen abundances in 16 stars that host transiting hot Jupiter exoplanets, and we compare our C/O ratios to those measured in larger samples of host stars, as well as those estimated for the corresponding exoplanet atmospheres. With standard stellar abundance analysis we derive stellar parameters as well as [C/H] and [O/H] from multiple abundance indicators, including synthesis fitting of the [O I] λ6300 line and non-LTE corrections for the O I triplet. Our results, in agreement with recent suggestions, indicate that previously measured exoplanet host star C/O ratios may have been overestimated. The mean transiting exoplanet host star C/O ratio from this sample is 0.54 (C/O☉ = 0.54), versus previously measured C/Ohost star means of ~0.65-0.75. We also observe the increase in C/O with [Fe/H] expected for all stars based on Galactic chemical evolution; a linear fit to our results falls slightly below that of other exoplanet host star studies but has a similar slope. Though the C/O ratios of even the most-observed exoplanets are still uncertain, the more precise abundance analysis possible right now for their host stars can help constrain these planets' formation environments and current compositions. Based on data collected at Subaru Telescope, which is operated by the National Astronomical Observatory of Japan. Some of the data presented herein were obtained at the W. M. Keck Observatory, which is operated as a scientific partnership among the California Institute of Technology, the University of California, and the National Aeronautics and Space Administration. The Observatory was made possible by the generous financial support of the W. M. Keck Foundation."
    },
    {
     "title": "Star-planet connection through metallicity",
     "adsabs": "https://ui.adsabs.harvard.edu/#abs/2014EAS....67..351A/abstract",
     "authors": "Adibekyan, V. Zh.; Figueira, P.; Santos, N. C.; Israelian, G.; Mortier, A.; Mordasini, C.; Delgado Mena, E.; Sousa, S. G.; Correi, A. C. M.; Oshagh, M.",
     "abstract": "We used a large sample of FGK dwarf planet-hosting stars with stellar parameters derived in a homogeneous way from the SWEET-Cat database (Santos et al. 2013) to study the relation between stellar metallicity and position of planets in the period-mass diagram. Using this large sample we show that planets orbiting metal-poor stars have longer periods than those in metal-rich systems. This trend is valid for masses at least from ≈ 10 M⊕ to ≈ 4 MJup. Moreover, Earth-like planets orbiting metal-rich stars always show shorter periods (≤20 days) than those orbiting metal-poor stars. However, in the short-period regime there are a similar number of planets orbiting metal-poor stars. Our results suggest that the planets in the P-MP diagram are evolving differently because of a mechanism that operates over a wide range of planetary masses. This mechanism is stronger or weaker depending on the metallicity of the respective system. Most probably planets in metal-poor disks form farther out from their central star and/or they form later and do not have time to migrate as far as the planets in metal-rich systems."
    },
  ]
}
